# RPA - 변화와 기회

> 이 글은 RedHat 블로그의 내용을 번역한 내용입니다.

보문은 2019-7-23 IT Toolbox의 내용에서 있습니다.

**RPA는 효율성 향상과 비용 절감을 실현하고자 하는 조직에게 놀라운 가능성을 제시합니다. 하지만 잠재력에 붕응하기 전에 몇가지 중요한 과제를 극복해야만 합니다. 이 기사는 그러한 과제들을 풀고 앞으로의 기회를 탐구합니다.**

지금쯤, 당신은 RPA(로봇 프로세스 자동화)에 대해 들어봤을 것입니다. RPA는 기업이 디지털화되기 위해 노력하면서 갑자기 나타난 새로운 아이디어가 아닙니다. RPA는 소프트웨어 로봇과 인간 작업 자동화를 통해 빠르고 상당한 비용 절감 효과를 제공하고 있습니다. 실제로 PwC는 "작업 활동의 45%가 자동화될 수 있으며, 이 자동화를 통해 전 세계 인력 비용을 2조 달러 절감할수 있을 것"이라고 추정합니다.

### 조직들이 직면한 도전들

오늘날 주문 입력 및 송장 준비와 같은 같단한 작업에서부터 문제 해결 및 고객 서비스와 같은 복잡한 상호 작용에 이르기까지 모든 것을 자동화하는 수천 개의 소프트웨어 로봇이 있습니다.

### 1. Cloud Infrastructure Challenge (클라우드 구조 문제)

먼저 클라우드 문제가 있습니다. RPA가 나타나기 전 조직들은 클라우드 컴퓨팅의 이점을 얻기 위해 다년간의 노력을 계획하느라 바빴습니다. IT클라우드로 옮기는 것은 비슷한 유인 비용 혜택을 제공하지만, 신기술과 신기술의 배치(Deployment)를 요구하는 장기 프로젝트다.

 서버가 없고 데이터센터가 없는 미래를 대비해 컨테이너, 조정, MSA 및 서비스 메시(Service Mesh) 아키텍처 등에 많은 투자가 이루어졌습니다.  하지만 RPA가 알아야할 것들이 있습니다.  여전히 데스크탑(Windows만 해당)에 국한되어 있다는 것을요.

 현재 배포된 소프트웨어 로봇의 대다수는 '참석형(attended)' 형태입니다. 이것은 윈도우 데스크톱에 존재한다는 것을 의미하는데, 마이크로소프트 오피스의 지나간 버전에 있는 작은 'Clippy' 조수처럼, 그들이 하는 일들은, 뒷 사무실 데이터베이스에서 스프레드시트로 일련의 데이터를 이동시켜, 여러분이 더 중요한 것에 집중할 수 있도록 합니다.

 최근 몇년간 RPA는 무인 봇이 윈도우 서버뒤편에서 당신의 기업 데이터를 조작할 수 있도록 진화했습니다. 이는 클라우드 방향의 한 단계이지만, 하이브리드 클라우드를 누비고 수정해야 하는 모든 사항을 해결할 수 있는 클라우드 네이티브 봇의 개념과는 거리가 멉니다.

언제 우리는 Kubernetes와 Istio 같은 표준 플랫폼에 의해 조정된 컨테이너화된 봇들을 볼수 있을까요? 아마도 RPA 공급업체들이 리눅스가 현대 클라우드에서 하는 중심적인 역할을 깨닫기 전까지는 아닐것입니다. 하지만 더 중요한건 RPA가 오픈소스로 전환되야 합니다. 왜냐? 오픈소스소프트웨어는 현대 클라우드 스택의 중심요소이며, RPA가 하이브리드 클라우드 인프라에서 역할을 하려면 오픈 소스여야 합니다.

### 2. Cost Challenge (비용 문제)

두 번째 문제는 RPA사용자들이 인건비를 절감하기 위한 만큼 봇들이 smart하지 않다는 것이다. 봇들은 일의 일부분에서 조금 다르게 들어났을때 어떻게 해결해야하는지 알아내는 능력이 사람만큼 뛰어나지 않다. 몇몇 봇들은 간단한 반복작업을 하는 매크로이지만, 다른것들은 실제로 복잡한 시나리오를 처리하기 위한 규칙엔진을 가지고 있지만 충분히 smart하지는 않습니다.

 AI와 Machine Learning의 세계는 현재 RPA와 별개로, IBM 왓슨과 같은 일부 봇이 AI서비스를 이용할 수 있을지라도, 봇들은 과거의 경험으로부터 배울 수 있는 내장된 능력이 없어 다음 번에 똑같은 성능을 보여주게 될것 입니다. 따라서 예상되는 비용 절감 효과가 항상 실현되는 것은 아니며, 봇은 고도로 구조화되고 반복적인 작업으로 제한될 수 있습니다. 하지만 클라우드와 마찬가지로 기회가 있습니다. 조만간 RPA와 AI/ML의 결합이 성사될 것으로 예상되며, 자동화 사업의 새로운 가능성을 열어줄 것입니다.

### 3. Implementation Challenge (구현 문제)

마지막으로 구현 문제가 있습니다 - 어떻게 RPA기술이 당신의 IT 계획에 배포할수 있는지. 일부 조직에서는 새로운 비즈니스 요구사항을 수용할 수 없는 노후화된 인프라인 경우 반자동화 프로세스의 병목 현상을 해소하기 위해 봇을 'band-aids'로 배포합니다. 이 방법은 즉각적인 문제를 해결할 수 있지만 운영 프로세스의 매 순간마다 다시 준단될 것입니다. 부분적으로는 RPA봇을 쉽게 배포할 수 있기때문 입니다. 새로운 송장에 필요한 추가 데이터 필드 하나를 얻기 위해 수신 가능한 계정과 앱과 같은 bot screen-scrape를 쉽게 만들 수 있는데 중요한 애플리케이션을 위한 API를 만드는 데 어려움을 겪는 이유는 무엇일까?

이러한 문제가 있는 조직은 먼저 클라우드 기반 구축에 집중해야 합니다. 그렇지 않으면 팀이 새로운 비즈니스 요청 시마다 봇을 계속 던지면 결국 데이터 센터 전체가 관리 불가능한 복잡성으로 인해 붕괴될 것입니다.

### Automating Human Work

RPA는 IT 시스템 및 애플리케이션의 결함을 보완하지 않고 인적 작업을 자동화 하는데 유용한 기술 입니다. RPA는 기존의 애플리케이션과 모니터링 시스템을 통합하는데 유용할 수 있게 만들어졌습니다.

 자동화의 기회는 크지만, IT인프라를 지원하는 것은 매우 중요합니다.  최신 클라우드 네이티브 애플리케이션 환경과 오픈 소스, 지능현 클라우드 네이티브 봇을 결합할 수 있는 기업은 타의 추종을 불허하는 경쟁 우위를 확복할 것이라고 생각합니다.

---

출처:

[Red Hat 블로그](https://www.redhat.com/ko/blog/robotic-process-automation-and-cloud-technology-challenges-and-opportunities)

